In [1]:
library(tidyverse)
employees <- read_csv("../../_build/data/employee_data.csv")

Registered S3 methods overwritten by 'ggplot2':
  method         from
  [.quosures     rlang
  c.quosures     rlang
  print.quosures rlang

Registered S3 method overwritten by 'rvest':
  method            from
  read_xml.response xml2

-- Attaching packages --------------------------------------- tidyverse 1.2.1 --

v ggplot2 3.1.1       v purrr   0.3.2
v tibble  2.1.1       v dplyr   0.8.0.1
v tidyr   0.8.3       v stringr 1.4.0
v readr   1.3.1       v forcats 0.4.0

-- Conflicts ------------------------------------------ tidyverse_conflicts() --
x dplyr::filter() masks stats::filter()
x dplyr::lag()    masks stats::lag()

Parsed with column specification:
cols(
  ID = col_double(),
  Name = col_character(),
  Gender = col_character(),
  Age = col_double(),
  Rating = col_double(),
  Degree = col_character(),
  Start_Date = col_character(),
  Retired = col_logical(),
  Division = col_character(),
  Salary = col_character()
)

# Data Frame Basics

Now that our employee data has been read into a data frame, we can begin exploring the data! We will start by exploring the dimensions of the data set. We can determine the **n**umber of **rows** (or observations) in our data set with the `nrow()` function:

```{admonition} Syntax
`nrow(x)`
+ *Required arguments*
  + `x`: A data frame.
```

In [2]:
nrow(employees)

[1] 1000

In [3]:
print(nrow(employees))

[1] 1000

Similarly, we can use `ncol()` to determine the **n**umber of **col**umns:

```{admonition} Syntax
`ncol(x)`
+ *Required arguments*
  + `x`: A data frame.
```

In [4]:
ncol(employees)

[1] 10

In [5]:
print(ncol(employees))

[1] 10

The `dim()` function returns the full **dim**ensions of the data (*i.e.*, both the number of rows and columns):

```{admonition} Syntax
`dim(x)`
+ *Required arguments*
  + `x`: A data frame.
```

In [6]:
dim(employees)

[1] 1000   10

In [7]:
print(dim(employees))

[1] 1000   10

We can view the first and last few rows of the data set with the `head()` and `tail()` functions, respectively:

```{admonition} Syntax
`head(x)` & `tail(x)`
+ *Required arguments*
  + `x`: A data frame.
```

In [8]:
head(employees)

  ID   Name                Gender Age Rating Degree      Start_Date Retired
1 6881 al-Rahimi, Tayyiba  Female 51  10     High School 2/23/1990  FALSE
2 2671 Lewis, Austin       Male   34   4     Ph.D        2/23/2007  FALSE
3 8925 el-Jaffer, Manaal   Female 50  10     Master's    2/23/1991  FALSE
4 2769 Soto, Michael       Male   52  10     High School 2/23/1987  FALSE
5 2658 al-Ebrahimi, Mamoon Male   55   8     Ph.D        2/23/1985  FALSE
6 1933 Medina, Brandy      Female 62   7     Associate's 2/23/1979   TRUE
  Division    Salary
1 Operations  $108,804
2 Engineering $182,343
3 Engineering $206,770
4 Sales       $183,407
5 Corporate   $236,240
6 Sales       NA

In [9]:
tail(employees)

  ID   Name                 Gender Age Rating Degree      Start_Date Retired
1 6681 Bruns, Austin        Male   41   8     Ph.D        2/23/2002  FALSE
2 2031 Martinez, Caleb      Male   57   8     Ph.D        2/23/1984  FALSE
3 2066 Gonzales, Alicia     Female 32   2     High School 2/23/2008  FALSE
4 3239 Larson, Trusten      Male   37   5     Bachelor's  2/23/2002  FALSE
5 3717 Levy-Minter, Quintin Male   53  10     Bachelor's  2/23/1989  FALSE
6 4209 Dena, Gianna         Female 49   6     Master's    2/23/1991  FALSE
  Division        Salary
1 Engineering     $188,656
2 Engineering     $218,430
3 Operations      $84,032
4 Human Resources $149,789
5 Operations      $172,703
6 Accounting      $185,445

It is easy to get a quick view of the **str**ucture of the data using the `str()` function. This shows the number of observations, the number of variables, the type of each variable, and the first few values of each variable. 

```{admonition} Syntax
`str(x)`
+ *Required arguments*
  + `x`: A data frame.
```

In [10]:
str(employees)

Classes 'spec_tbl_df', 'tbl_df', 'tbl' and 'data.frame':	1000 obs. of  10 variables:
 $ ID        : num  6881 2671 8925 2769 2658 ...
 $ Name      : chr  "al-Rahimi, Tayyiba" "Lewis, Austin" "el-Jaffer, Manaal" "Soto, Michael" ...
 $ Gender    : chr  "Female" "Male" "Female" "Male" ...
 $ Age       : num  51 34 50 52 55 62 47 43 27 30 ...
 $ Rating    : num  10 4 10 10 8 7 8 8 7 6 ...
 $ Degree    : chr  "High School" "Ph.D" "Master's" "High School" ...
 $ Start_Date: chr  "2/23/1990" "2/23/2007" "2/23/1991" "2/23/1987" ...
 $ Retired   : logi  FALSE FALSE FALSE FALSE FALSE TRUE ...
 $ Division  : chr  "Operations" "Engineering" "Engineering" "Sales" ...
 $ Salary    : chr  "$108,804" "$182,343" "$206,770" "$183,407" ...
 - attr(*, "spec")=
  .. cols(
  ..   ID = col_double(),
  ..   Name = col_character(),
  ..   Gender = col_character(),
  ..   Age = col_double(),
  ..   Rating = col_double(),
  ..   Degree = col_character(),
  ..   Start_Date = col_character(),
  ..   Retired = col_logical(),
  ..   Division = col_character(),
  ..   Salary = col_character()
  .. )

In [11]:
print(str(employees))

Classes 'spec_tbl_df', 'tbl_df', 'tbl' and 'data.frame':	1000 obs. of  10 variables:
 $ ID        : num  6881 2671 8925 2769 2658 ...
 $ Name      : chr  "al-Rahimi, Tayyiba" "Lewis, Austin" "el-Jaffer, Manaal" "Soto, Michael" ...
 $ Gender    : chr  "Female" "Male" "Female" "Male" ...
 $ Age       : num  51 34 50 52 55 62 47 43 27 30 ...
 $ Rating    : num  10 4 10 10 8 7 8 8 7 6 ...
 $ Degree    : chr  "High School" "Ph.D" "Master's" "High School" ...
 $ Start_Date: chr  "2/23/1990" "2/23/2007" "2/23/1991" "2/23/1987" ...
 $ Retired   : logi  FALSE FALSE FALSE FALSE FALSE TRUE ...
 $ Division  : chr  "Operations" "Engineering" "Engineering" "Sales" ...
 $ Salary    : chr  "$108,804" "$182,343" "$206,770" "$183,407" ...
 - attr(*, "spec")=
  .. cols(
  ..   ID = col_double(),
  ..   Name = col_character(),
  ..   Gender = col_character(),
  ..   Age = col_double(),
  ..   Rating = col_double(),
  ..   Degree = col_character(),
  ..   Start_Date = col_character(),
  ..   Retired = col_logical(),
  ..   Division = col_character(),
  ..   Salary = col_character()
  .. )
NULL

After reading in a data set, it is best practice to check the dimensions of the data and explore its structure using the functions shown in this section. This will help uncover any immediate problems with the data.

So far we have seen some functions that can applied to an entire data frame. However, we often want to work with an individual column in a data frame. For example, we may be interested in calculating the average `Age` of all employees in the data set. We can access specific columns of a data frame using the `$` operator, which takes the general form:

```{admonition} Syntax
`dataFrameName$variableName`
```

If we write `employees$Age`, we will get an atomic vector with the age of the 1,000 employees in the data frame. If you recall from the previous chapter, there are many different functions we can apply to atomic vectors in R. Because `employees$Age` is an atomic vector, we can apply those functions here to explore the `Age` variable. For example, to calculate the mean, minimum, and maximum `Age`, we could write:

In [12]:
mean(employees$Age)
min(employees$Age)
max(employees$Age)

[1] 45.53

[1] 25

[1] 65

In [13]:
print(mean(employees$Age))
print(min(employees$Age))
print(max(employees$Age))

[1] 45.53

[1] 25

[1] 65